const DUMMY_DATA = [
    {
        report: [
            {
                id: 'r1',
                title: 'گزارشگری و افشای اطلاعات',
                children: [
                    {
                        id: 'r1-1',
                        txt: 'مشخصات ثبتی شرکت',
                    },
                    {
                        id: 'r1-2',
                        txt: 'اساسنامه شرکت',
                    },
                    {
                        id: 'r1-3',
                        txt: 'مشخصات و اطلاعات مدیران شرکت',
                    },
                    {
                        id: 'r1-4',
                        txt: 'چشم انداز، ماموریت و اهداف راهبردی',
                    },
                    {
                        id: 'r1-5',
                        txt: 'چشم انداز، ماموریت و اهداف راهبردی',
                    },
                    {
                        id: 'r1-6',
                        txt: 'چشم انداز، ماموریت و اهداف راهبردی',
                    },
                    {
                        id: 'r1-7',
                        txt: 'چشم انداز، ماموریت و اهداف راهبردی',
                    },{
                        id: 'r1-8',
                        txt: 'چشم انداز، ماموریت و اهداف راهبردی',
                    },{
                        id: 'r1-9',
                        txt: 'چشم انداز، ماموریت و اهداف راهبردی',
                    },{
                        id: 'r1-10',
                        txt: 'چشم انداز، ماموریت و اهداف راهبردی',
                    },
                ],
            },
        ],
        id: 'r1',
        title: 'گزارشگری و افشای اطلاعات',
        children: [
            {
                id: 'r1-1',
                txt: 'مشخصات ثبتی شرکت',
            },
            {
                id: 'r1-2',
                txt: 'اساسنامه شرکت',
            },
            {
                id: 'r1-3',
                txt: 'مشخصات و اطلاعات مدیران شرکت',
            },
            {
                id: 'r1-4',
                txt: 'چشم انداز، ماموریت و اهداف راهبردی',
            },
            {
                id: 'r1-5',
                txt: 'چشم انداز، ماموریت و اهداف راهبردی',
            },
            {
                id: 'r1-6',
                txt: 'چشم انداز، ماموریت و اهداف راهبردی',
            },
            {
                id: 'r1-7',
                txt: 'چشم انداز، ماموریت و اهداف راهبردی',
            },{
                id: 'r1-8',
                txt: 'چشم انداز، ماموریت و اهداف راهبردی',
            },{
                id: 'r1-9',
                txt: 'چشم انداز، ماموریت و اهداف راهبردی',
            },{
                id: 'r1-10',
                txt: 'چشم انداز، ماموریت و اهداف راهبردی',
            },
        ],
    },
    {
        id: 'r2',
        title: 'گزارشگری و افشای ',
        children: [
            {
                id: 'r2-1',
                txt: 'مشخصات ثبتی شرکت',
            },
            {
                id: 'r2-2',
                txt: 'اساسنامه شرکت',
            },
            {
                id: 'r2-3',
                txt: 'مشخصات و اطلاعات مدیران شرکت',
            },
            {
                id: 'r2-4',
                txt: 'چشم انداز، ماموریت و اهداف راهبردی',
            },
            {
                id: 'r2-5',
                txt: 'چشم انداز، ماموریت و اهداف راهبردی',
            },
            {
                id: 'r2-6',
                txt: 'چشم انداز، ماموریت و اهداف راهبردی',
            },
            {
                id: 'r2-7',
                txt: 'چشم انداز، ماموریت و اهداف راهبردی',
            },{
                id: 'r2-8',
                txt: 'چشم انداز، ماموریت و اهداف راهبردی',
            },{
                id: 'r2-9',
                txt: 'چشم انداز، ماموریت و اهداف راهبردی',
            },{
                id: 'r2-10',
                txt: 'چشم انداز، ماموریت و اهداف راهبردی',
            },
        ],
    },
];

export const getAllReport = () => {
    return DUMMY_DATA;
};